Revit 2027 API
BuiltInFailures.SlabShapeFailures.SlabShapeCannotPasteSubpicksInvalidTarget Property
 Cannot paste points or lines. Select a slab and modify sub elements to paste points or lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SlabShapeCannotPasteSubpicksInvalidTarget { get; }
Public Shared ReadOnly Property SlabShapeCannotPasteSubpicksInvalidTarget As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SlabShapeCannotPasteSubpicksInvalidTarget {
	FailureDefinitionId^ get ();
}
static member SlabShapeCannotPasteSubpicksInvalidTarget : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SlabShapeFailures Class
Autodesk.Revit.DB Namespace